; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite4 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	thermograph4 - mode
	thermograph3 - mode
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	star4 - direction
	groundstation2 - direction
	star0 - direction
	star1 - direction
	star3 - direction
	phenomenon5 - direction
	planet6 - direction
	planet7 - direction
	star8 - direction
	star9 - direction
	star10 - direction
	planet11 - direction
	phenomenon12 - direction
	phenomenon13 - direction
	planet14 - direction
	star15 - direction
	phenomenon16 - direction
	phenomenon17 - direction
	phenomenon18 - direction
	planet19 - direction
	planet20 - direction
	phenomenon21 - direction
	star22 - direction
	planet23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 star4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 star0)
	(supports instrument2 image1)
	(calibration_target instrument2 star4)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 star8)
	(supports instrument4 image1)
	(calibration_target instrument4 groundstation2)
	(supports instrument5 thermograph4)
	(supports instrument5 image1)
	(calibration_target instrument5 star1)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 star0)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 groundstation2)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon17)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 star3)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet20)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 star1)
	(supports instrument10 thermograph3)
	(supports instrument10 image1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 star1)
	(supports instrument11 thermograph0)
	(supports instrument11 image1)
	(calibration_target instrument11 groundstation2)
	(supports instrument12 image1)
	(calibration_target instrument12 star4)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 groundstation2)
	(supports instrument14 thermograph2)
	(supports instrument14 thermograph4)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 star1)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(on_board instrument14 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet19)
	(supports instrument15 thermograph3)
	(supports instrument15 thermograph0)
	(supports instrument15 thermograph4)
	(calibration_target instrument15 star1)
	(supports instrument16 thermograph0)
	(supports instrument16 thermograph3)
	(supports instrument16 thermograph4)
	(calibration_target instrument16 star0)
	(supports instrument17 thermograph3)
	(supports instrument17 thermograph0)
	(calibration_target instrument17 star3)
	(supports instrument18 image1)
	(calibration_target instrument18 star1)
	(supports instrument19 thermograph2)
	(supports instrument19 thermograph0)
	(calibration_target instrument19 star3)
	(on_board instrument15 satellite4)
	(on_board instrument16 satellite4)
	(on_board instrument17 satellite4)
	(on_board instrument18 satellite4)
	(on_board instrument19 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star3)
)
(:goal (and
	(pointing satellite1 star1)
	(pointing satellite4 planet23)
	(have_image phenomenon5 thermograph4)
	(have_image planet7 image1)
	(have_image star8 thermograph3)
	(have_image star9 image1)
	(have_image star10 image1)
	(have_image phenomenon13 thermograph2)
	(have_image star15 thermograph2)
	(have_image phenomenon17 thermograph4)
	(have_image phenomenon18 image1)
	(have_image planet19 thermograph2)
	(have_image planet20 thermograph4)
	(have_image phenomenon21 image1)
	(have_image star22 thermograph3)
))

)

; plan
1. (switch_on instrument15 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument15)
   goals met: 0 of 15
2. (switch_on instrument14 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument14)
   goals met: 0 of 15
3. (switch_on instrument3 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument3)
   goals met: 0 of 15
4. (turn_to satellite4 planet23 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 planet23)
   goals met: 1 of 15
5. (turn_to satellite1 star1 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star1)
   goals met: 2 of 15
6. (turn_to satellite3 star1 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 star1)
   goals met: 2 of 15
7. (calibrate satellite3 instrument14 star1)
   added: (calibrated instrument14)
   goals met: 2 of 15
8. (turn_to satellite3 phenomenon13 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon13)
   goals met: 2 of 15
9. (take_image satellite3 phenomenon13 instrument14 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 3 of 15
10. (turn_to satellite3 phenomenon17 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon17)
   goals met: 3 of 15
11. (take_image satellite3 phenomenon17 instrument14 thermograph4)
   added: (have_image phenomenon17 thermograph4)
   goals met: 4 of 15
12. (turn_to satellite3 phenomenon5 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon5)
   goals met: 4 of 15
13. (take_image satellite3 phenomenon5 instrument14 thermograph4)
   added: (have_image phenomenon5 thermograph4)
   goals met: 5 of 15
14. (turn_to satellite3 planet19 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 planet19)
   goals met: 5 of 15
15. (take_image satellite3 planet19 instrument14 thermograph2)
   added: (have_image planet19 thermograph2)
   goals met: 6 of 15
16. (turn_to satellite3 planet20 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 planet20)
   goals met: 6 of 15
17. (take_image satellite3 planet20 instrument14 thermograph4)
   added: (have_image planet20 thermograph4)
   goals met: 7 of 15
18. (turn_to satellite3 star15 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 star15)
   goals met: 7 of 15
19. (take_image satellite3 star15 instrument14 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 8 of 15
20. (turn_to satellite0 star3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star3)
   goals met: 8 of 15
21. (calibrate satellite0 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 8 of 15
22. (turn_to satellite0 phenomenon18 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon18)
   goals met: 8 of 15
23. (take_image satellite0 phenomenon18 instrument3 image1)
   added: (have_image phenomenon18 image1)
   goals met: 9 of 15
24. (turn_to satellite0 phenomenon21 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon21)
   goals met: 9 of 15
25. (take_image satellite0 phenomenon21 instrument3 image1)
   added: (have_image phenomenon21 image1)
   goals met: 10 of 15
26. (turn_to satellite0 planet7 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 planet7)
   goals met: 10 of 15
27. (take_image satellite0 planet7 instrument3 image1)
   added: (have_image planet7 image1)
   goals met: 11 of 15
28. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 11 of 15
29. (take_image satellite0 star10 instrument3 image1)
   added: (have_image star10 image1)
   goals met: 12 of 15
30. (turn_to satellite0 star22 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star22)
   goals met: 12 of 15
31. (take_image satellite0 star22 instrument3 thermograph3)
   added: (have_image star22 thermograph3)
   goals met: 13 of 15
32. (turn_to satellite0 star8 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 star8)
   goals met: 13 of 15
33. (take_image satellite0 star8 instrument3 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 14 of 15
34. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 14 of 15
35. (take_image satellite0 star9 instrument3 image1)
   added: (have_image star9 image1)
   goals met: 15 of 15
